[
    {
        "label": 2,
        "author": "Ajay Gupta",
        "title": "Policy Framework for Autonomic Data Managemen",
        "abstract": "Abstract The popularity ,of  e-Business ,has ,lead ,to  an  exponential,and ,unstructured ,growth ,in  the  applications space  coupled ,with  an  increase ,in  the  database,size.   This  has  led  to  an ,increase  in  the  complexity,of  the ,database ,management ,task.  Moreover, organizations  are  increasingly  concerned  about the privacy of data. Thus, managing such large ever,growing ,and ,privacy-preserving  database ,is  complex,and  time-consuming ,task.  In  this",
        "coauthors": [
            "manish bhide",
            "mukul joshi",
            "mukesh k. mohania",
            "shree raman"
        ]
    },

    {
        "label": 5,
        "author": "Ajay K. Gupta",
        "title": "Using Predators to Combat Worms and Viruses: A Simulation-Based Study",
        "abstract": "Large-scale attacks generated by fast-spreading or stealthy malicious mobile code, such as ash worms and e-mail viruses, demand new approaches to patch management and disinfection. Currently popular centralized approaches suf- fer from distribution bottlenecks which cannot be solved by merely increasing the number of servers, as the number of servers required to eliminate all bottlenecks is imprac- tically large. Recently,",
        "coauthors": [
            "daniel c. duvarney"
        ]
    },
    {
        "label": 3,
        "author": "Ajay Gupta",
        "title": "IT Infrastructure in Emerging Markets: Arguing for an End-to-End Perspective",
        "abstract": "",
        "coauthors": [
            "parthasarathy ranganathan",
            "prashant sarin",
            "mehul a. shah"
        ]
    },
    {
        "label": 2,
        "author": "Ajay Gupta",
        "title": "Optimal Deployment of Triggers for Detecting Events",
        "abstract": "",
        "coauthors": [
            "manish bhide",
            "mukul joshi",
            "mukesh k. mohania"
        ]
    },
    {
        "label": 2,
        "author": "Ajay Gupta",
        "title": "LIPTUS: associating structured and unstructured information in a banking environment",
        "abstract": "Growing competition has made today's banks understand the value of knowing their customers better. In this paper, we describe a tool, LIPTUS, that associates the customer interactions (emails and transcribed phone calls) with customer and account profiles stored in an existing data warehouse. The associations discovered by LIPTUS enable analytics spanning the customer and account profiles on one hand and",
        "coauthors": [
            "manish bhide",
            "rahul gupta",
            "prasan roy",
            "mukesh k. mohania",
            "zenita ichhaporia"
        ]
    },
    {
        "label": 6,
        "author": "Ajay K. Gupta",
        "title": "Interactive Distance Learning over Intranets",
        "abstract": " this article we describe IRI and the lessons learned deploying it. We first deployed IRI to teacha fall 1995 graduate course in software metrics. We then evaluated it in terms of logistics, reliability,performance, and usability, performing off-line experiments to try out new features and to developprotocols that would improve IRI use. We subsequently reengineered IRI into an open architecturewith a",
        "coauthors": [
            "kurt maly",
            "hussein m. abdel-wahab",
            "c. michael overstreet",
            "j. christian wild",
            "alaa youssef",
            "emilia stoica",
            "ehab s. al-shaer"
        ]
    },
    {
        "label": 6,
        "author": "Ajay K. Gupta",
        "title": "Mosaic + XTV = CoReview",
        "abstract": "",
        "coauthors": [
            "kurt maly",
            "hussein m. abdel-wahab",
            "ravi mukkamala",
            "a. prabhu",
            "h. syed",
            "c. s. vemuru"
        ]
    },
    {
        "label": 6,
        "author": "Ajay K. Gupta",
        "title": "BTU: A Host Communication Benchmark",
        "abstract": " In this paper we propose a communication benchmark suite: BTU(Bits To the User). In the BTUbenchmarking process, the vendor supplies a workstation running a UNIX2operating system, we installour benchmark program and connect the workstation to a testbed, consisting of blackboxes, which emulatesa LAN/WAN environment. The benchmark run will submit the workstation to a carefully designed combinationof tests. The result is",
        "coauthors": [
            "kurt maly",
            "satish mynam"
        ]
    },
    {
        "label": 6,
        "author": "Ajay K. Gupta",
        "title": "The software architecture and interprocess communications of IRI: an Internet-based interactive distance learning system",
        "abstract": " This paper discusses the software architecture, interprocesscommunication and the reference implementationof IRI, an Interactive Remote Instruction systemfor distance learning. IRI is an Internet-based systemwhich integrates continuous multimedia, shared applicationsand a variety of multi-user collaborative utilities.Internet multicasting is used by IRI for groupmanagement and data sharing; UDP-multicasting isused for audio and video streams while reliable multicastingprotocol (RMP) is ...",
        "coauthors": [
            "hussein m. abdel-wahab",
            "kurt maly",
            "alaa youssef",
            "emilia stoica",
            "c. michael overstreet",
            "j. christian wild"
        ]
    },
    {
        "label": 6,
        "author": "Ajay K. Gupta",
        "title": "Performance trade-offs for a multimedia distributed application",
        "abstract": "",
        "coauthors": [
            "kurt maly",
            "c. michael overstreet",
            "hussein m. abdel-wahab",
            "muthu kumar",
            "rahul srivastava"
        ]
    },
    {
        "label": 3,
        "author": "Ajay Gupta",
        "title": "Hardware Diagnosis as Program Debugging",
        "abstract": "Horn clauses provide a useful framework for writing executable structural representations for digital circuits. This paper discusses how these representations can be used to diagnose faulty circuits using algorithmic program debugging techniques developed by Shapiro. The sound theoretical basis of these techniques is one of the major advantages of this approach. This framework also provides a new perspective on some",
        "coauthors": []
    },
    {
        "label": 2,
        "author": "Ajay Gupta",
        "title": "Enhanced Business Intelligence using EROCS",
        "abstract": "",
        "coauthors": [
            "manish bhide",
            "v. chakravarthy",
            "himanshu gupta",
            "mukesh k. mohania",
            "kriti puniyani",
            "prasan roy",
            "sourashis roy",
            "vibhuti s. sengar"
        ]
    },
    {
        "label": 2,
        "author": "Ajay Gupta",
        "title": "Management of Conflicting Obligations in Self-Protecting Policy-Based Systems",
        "abstract": "",
        "coauthors": [
            "rema ananthanarayanan",
            "mukesh k. mohania"
        ]
    },
    {
        "label": 5,
        "author": "Ajay K. Gupta",
        "title": "Resource Usage Policy Specification for Managing Application Resources",
        "abstract": "",
        "coauthors": [
            "prem uppuluri"
        ]
    },
    {
        "label": 2,
        "author": "Ajay Gupta",
        "title": "Towards Bringing Database Management Task in the Realm of IT non-Experts",
        "abstract": "",
        "coauthors": [
            "manish bhide",
            "mukesh k. mohania"
        ]
    },
    {
        "label": 5,
        "author": "Ajay K. Gupta",
        "title": "An Approach for Detecting Self-propagating Email Using Anomaly Detection",
        "abstract": "This paper develops a new approach for detecting self-propagating email viruses based on statistical anomaly detection. Our approach assumes that a key objective of an email virus attack is to eventually overwhelm mail servers and clients with a large volume of email traffic. Based on this assumption, the approach is designed to detect increases in traffic volume over what was",
        "coauthors": [
            "r. sekar"
        ]
    },
    {
        "label": 6,
        "author": "Ajay K. Gupta",
        "title": "CoProcess: A Java-based Environment for Collaborative Process Management Over the Web",
        "abstract": " CoProcess is a Java-based environment to facilitate collaborative process management overthe World-wide Web (WWW). It can support a wide variety of applications that may involvefilling forms, sending e-mail, searching a database (or web) for information, establishing a teleconferencewithin a group, collaborative writing, reviewing, and editing of documents, and othervideo and audio record/playback facilities. In this paper, we describe the CoProcess",
        "coauthors": [
            "kurt maly",
            "hussein m. abdel-wahab",
            "ravi mukkamala",
            "mohamed kholief",
            "s. dittakavi",
            "c. s. vemuru",
            "h. syed"
        ]
    },
    {
        "label": 6,
        "author": "Ajay K. Gupta",
        "title": "A privilege management and enforcement system for distributed resource sharing",
        "abstract": "",
        "coauthors": [
            "kurt maly",
            "bjorn kvande",
            "irwin b. levinstein",
            "ravi mukkamala",
            "s. nanjangud",
            "margrethe h. olson",
            "roy whitney",
            "rita chambers"
        ]
    },
    {
        "label": 6,
        "author": "Ajay K. Gupta",
        "title": "IRI-h, a Java-based distance education system",
        "abstract": "",
        "coauthors": [
            "kurt maly",
            "hussein m. abdel-wahab",
            "j. christian wild",
            "c. michael overstreet",
            "ayman adel abdel hamid",
            "sahar m. ghanem",
            "agustin gonzález",
            "xiaoqing zhu"
        ]
    },
    {
        "label": 3,
        "author": "Ajay Gupta",
        "title": "AGATHA: An Integrated Expert System to Test and Diagnose Complex Personal Computer Boards",
        "abstract": "",
        "coauthors": [
            "daryl allred",
            "yossi lichtenstein",
            "chris preist",
            "michael a. bennett"
        ]
    },
    {
        "label": 2,
        "author": "Ajay Gupta",
        "title": "Web Page Ranking Based on Events",
        "abstract": "",
        "coauthors": [
            "manish bhide",
            "mukesh k. mohania"
        ]
    }
]